# Theme
romkatv/powerlevel10k

# Prompt plugins
ohmyzsh/ohmyzsh path:plugins/virtualenv

# Helper plugins
ohmyzsh/ohmyzsh path:plugins/command-not-found

# First-party autocompletions and aliases
# ohmyzsh/ohmyzsh path:plugins/aws
# ohmyzsh/ohmyzsh path:plugins/gem
# ohmyzsh/ohmyzsh path:plugins/golang
# ohmyzsh/ohmyzsh path:plugins/gradle
# ohmyzsh/ohmyzsh path:plugins/heroku
# ohmyzsh/ohmyzsh path:plugins/mvn
# ohmyzsh/ohmyzsh path:plugins/npm
# ohmyzsh/ohmyzsh path:plugins/nvm
# ohmyzsh/ohmyzsh path:plugins/pip
# ohmyzsh/ohmyzsh path:plugins/pipenv
# ohmyzsh/ohmyzsh path:plugins/redis-cli
# ohmyzsh/ohmyzsh path:plugins/vagrant
# ohmyzsh/ohmyzsh path:plugins/yarn

# Autocompletions
# lukechilds/zsh-better-npm-completion
srijanshetty/zsh-pip-completion path:src kind:fpath
zsh-users/zsh-completions path:src kind:fpath

# Fish-like suggestions, history searching, and syntax highlighting
zsh-users/zsh-autosuggestions kind:defer
zsh-users/zsh-history-substring-search
zsh-users/zsh-syntax-highlighting kind:defer
