# Dependencies
getantidote/use-omz
ohmyzsh/ohmyzsh path:lib


# Theme
romkatv/powerlevel10k

# Debug plugins
romkatv/zsh-bench kind:path

# Helper plugins
ohmyzsh/ohmyzsh path:plugins/colored-man-pages
ohmyzsh/ohmyzsh path:plugins/command-not-found


# Autocompletions setup
mattmc3/ez-compinit
belak/zsh-utils path:completion/functions kind:autoload post:compstyle_zshzoo_setup

# First-party autocompletions and aliases
# @see https://github.com/ohmyzsh/ohmyzsh/wiki/plugins
ohmyzsh/ohmyzsh path:plugins/aws kind:fpath
ohmyzsh/ohmyzsh path:plugins/brew kind:fpath conditional:is-macos
ohmyzsh/ohmyzsh path:plugins/bun kind:fpath
ohmyzsh/ohmyzsh path:plugins/deno kind:fpath
ohmyzsh/ohmyzsh path:plugins/docker kind:fpath
ohmyzsh/ohmyzsh path:plugins/docker-compose kind:fpath
ohmyzsh/ohmyzsh path:plugins/gem kind:fpath
#ohmyzsh/ohmyzsh path:plugins/gh kind:fpath
ohmyzsh/ohmyzsh path:plugins/git kind:fpath
ohmyzsh/ohmyzsh path:plugins/golang kind:fpath
ohmyzsh/ohmyzsh path:plugins/gradle kind:fpath
ohmyzsh/ohmyzsh path:plugins/helm kind:fpath
ohmyzsh/ohmyzsh path:plugins/heroku kind:fpath
ohmyzsh/ohmyzsh path:plugins/jfrog kind:fpath
ohmyzsh/ohmyzsh path:plugins/kops kind:fpath
ohmyzsh/ohmyzsh path:plugins/kubectl kind:fpath
ohmyzsh/ohmyzsh path:plugins/kubectx kind:fpath
ohmyzsh/ohmyzsh path:plugins/localstack kind:fpath
ohmyzsh/ohmyzsh path:plugins/minikube kind:fpath
ohmyzsh/ohmyzsh path:plugins/mvn kind:fpath
ohmyzsh/ohmyzsh path:plugins/npm kind:fpath
ohmyzsh/ohmyzsh path:plugins/nvm kind:fpath
ohmyzsh/ohmyzsh path:plugins/pip kind:fpath
ohmyzsh/ohmyzsh path:plugins/pipenv kind:fpath
ohmyzsh/ohmyzsh path:plugins/pyenv kind:fpath
ohmyzsh/ohmyzsh path:plugins/python kind:fpath
ohmyzsh/ohmyzsh path:plugins/rails kind:fpath
ohmyzsh/ohmyzsh path:plugins/redis-cli kind:fpath
ohmyzsh/ohmyzsh path:plugins/ruby kind:fpath
ohmyzsh/ohmyzsh path:plugins/terraform kind:fpath
ohmyzsh/ohmyzsh path:plugins/vagrant kind:fpath
ohmyzsh/ohmyzsh path:plugins/yarn kind:fpath

# Autocompletions
# lukechilds/zsh-better-npm-completion
srijanshetty/zsh-pip-completion path:src kind:fpath
zsh-users/zsh-completions path:src kind:fpath

# Fish-like suggestions, history searching, and syntax highlighting
zsh-users/zsh-autosuggestions kind:defer
zsh-users/zsh-history-substring-search
zdharma-continuum/fast-syntax-highlighting
